InformationRegisters/УченыеЗванияФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УченыеЗванияФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УченоеЗвание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеЗвания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрисвоенияУченогоЗвания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АттестатСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АттестатНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АттестатВыданОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаучнаяСпециальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УченыеЗванияФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеУченогоЗванияФизическогоЛица(ФизическоеЛицоСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УченыеЗванияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо1,
		|	УченыеЗванияФизическихЛиц.НомерПоПорядку,
		|	УченыеЗванияФизическихЛиц.УченоеЗвание,
		|	УченыеЗванияФизическихЛиц.ДатаПрисвоенияУченогоЗвания,
		|	УченыеЗванияФизическихЛиц.АттестатСерия,
		|	УченыеЗванияФизическихЛиц.АттестатНомер,
		|	УченыеЗванияФизическихЛиц.АттестатВыданОрганизация,
		|	УченыеЗванияФизическихЛиц.НаучнаяСпециальность
		|ИЗ
		|	РегистрСведений.УченыеЗванияФизическихЛиц КАК УченыеЗванияФизическихЛиц
		|ГДЕ
		|	УченыеЗванияФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицоСсылка";
		
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	
	Возврат ПредставлениеУченогоЗванияПоКоллекцииЗаписей(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ПредставлениеУченогоЗванияПоКоллекцииЗаписей(НаборЗаписей) Экспорт
	
	ПредставлениеУченыеЗвания = "";
	
	ПоследнееУченоеЗвание = Неопределено;
	Для Каждого СтрокаУченыеЗвания Из НаборЗаписей Цикл
		Если ПоследнееУченоеЗвание = Неопределено ИЛИ ПоследнееУченоеЗвание.ДатаПрисвоенияУченогоЗвания < СтрокаУченыеЗвания.ДатаПрисвоенияУченогоЗвания Тогда
			ПоследнееУченоеЗвание = СтрокаУченыеЗвания;
		КонецЕсли; 
	КонецЦикла;
	
	Если ПоследнееУченоеЗвание <> Неопределено Тогда
		ПредставлениеУченыеЗвания 	= ?(ЗначениеЗаполнено(ПоследнееУченоеЗвание.УченоеЗвание), Строка(ПоследнееУченоеЗвание.УченоеЗвание), "");
		ПредставлениеУченыеЗвания = ПредставлениеУченыеЗвания + ?(ЗначениеЗаполнено(ПоследнееУченоеЗвание.НаучнаяСпециальность), ?(ПустаяСтрока(ПредставлениеУченыеЗвания), "", ", ") + Строка(ПоследнееУченоеЗвание.НаучнаяСпециальность), "");
		ПредставлениеУченыеЗвания = ПредставлениеУченыеЗвания + ?(ЗначениеЗаполнено(ПоследнееУченоеЗвание.ДатаПрисвоенияУченогоЗвания), ?(ПустаяСтрока(ПредставлениеУченыеЗвания), "", ", ") + Формат(ПоследнееУченоеЗвание.ДатаПрисвоенияУченогоЗвания, "ДЛФ=D"), "");
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеУченыеЗвания) Тогда
		ПредставлениеУченыеЗвания = НСтр("ru='Ученые звания не присваивались';uk='Вчені звання не присвоювалися'");
	КонецЕсли; 
	
	Возврат ПредставлениеУченыеЗвания;
	
КонецФункции

#КонецОбласти

#КонецЕсли
